# @author: Hugues Balp
# Please tangle this file and look at the usage sections

** Usage of script prepare_demo.gen.sh				      :usage:

    #+BEGIN_SRC sh :shebang "#!/bin/bash" :results verbatim # C-c C-v C-e
source ./prepare_demo.gen.sh
usage_prepare_demo
    #+END_SRC

    #+RESULTS:
    #+begin_example
    usage_prepare_demo usage:
    either:

      build all config with: 
	 > prepare_all_tests
    or 
      choose among the following configurations:

      1. Integration tests with or without countermeasure (with libxml2):
	 > prepare_it_with_system_lib && execute_it_with_system_lib

      2. Unit tests with or without countermeasure:
	 > prepare_ut_with_gdb &&
	 > execute_ut_without_xsw_countermeasure && 
	 > execute_ut_with_xsw_countermeasure ||
	 > debug_ut_with_xsw_countermeasure

      3. Callers analysis with or without libxml2:
	 > prepare_callers_without_libxml2
	 > prepare_callers_without_libxml2

      4. Frama-c Value Analysis:
	 > prepare_fc_va ||
	 > update_fc_va
#+end_example

   #+BEGIN_SRC sh :shebang "#!/bin/bash" tangle :tangle prepare_demo.gen.sh
function usage_prepare_demo()
{
    cat > /dev/stdout <<EOF

usage_prepare_demo usage:
either:

  build all config with: 
     > prepare_all_tests
or 
  choose among the following configurations:

  1. Integration tests with or without countermeasure (with libxml2):
     > prepare_it_with_system_lib && execute_it_with_system_lib

  2. Unit tests with or without countermeasure:
     > prepare_ut_with_gdb &&
     > execute_ut_without_xsw_countermeasure && 
     > execute_ut_with_xsw_countermeasure ||
     > debug_ut_with_xsw_countermeasure

  3. Callers analysis with or without libxml2:
     > prepare_callers_with_libxml2
     > prepare_callers_without_libxml2

  4. Frama-c Value Analysis:
     > prepare_fc_va ||
     > update_fc_va
EOF
}
   #+END_SRC

*** Usage of script libxml2_install.sh				      :usage:

    #+BEGIN_SRC sh :shebang "#!/bin/bash" :results verbatim # C-c C-v C-e
source ./libxml2_install.sh
usage_libxml2_install
    #+END_SRC

    #+RESULTS:
    #+begin_example
    Usage of script libxml2_install.sh
    5 features:
    1) System install of libxml2:
       > libxml2_workflow_system_install
    2) Source install of libxml2:
       > libxml2_workflow_sources_gdb <git|local>
    3) Source Callers analysis of libxml2:
       > libxml2_workflow_sources_callers <git|local>
    4) Frama-C builtin preprocessing of libxml2:
       > libxml2_workflow_fc_va <git|local>
    5) Frama-C update preprocessing of libxml2:
       > libxml2_update_fc_preproc
#+end_example

*** Usage of script test_saml_sign.launch.sh			      :usage:

   #+BEGIN_SRC sh :shebang "#!/bin/bash" :results verbatim # C-c C-v C-e
source ./test_saml_sign.launch.sh
usage_test_saml_sign_launch
   #+END_SRC

   #+RESULTS:
   : test_saml_sign usage:
   : either:
   :   build all config with: cmake_build_all
   : or:
   :   1: cmake_config_common
   :   2: choose one of the cmake_config_* function
   :   3: call script cmake_build_execute to generate and build the config
   :   with the appropriate generated cmake file CMakeLists.txt

